#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>

#define min(a, b)	(((a) < (b)) ? (a) : (b))		/* ２個の値の最小値 */

/********************************************************************************************************************************/
/* main *************************************************************************************************************************/
/********************************************************************************************************************************/
int DEBUG = 0;										/* デバッグプリント 提出時は0 */

int main()
{

	int		N;
	int		i,j, a,b,ba;
	char	s[10000][11];
	int		ans = 0;

	scanf("%d", &N);
	for (i=0; i<N; i++) {
		scanf("%s", s[i]);
		for(j=0; j<10; j++) {
			if (s[i][j+1]==0) break;
			if ((s[i][j]=='A')&&(s[i][j+1]=='B')) ans++;
		}
		s[i][1] = s[i][strlen(s[i])-1];
		s[i][2] = 0;
	}

	a = b = ba = 0;
	for (i=0; i<N; i++) {
		if (s[i][0]=='B') {
			if (s[i][1]=='A') {
				ba++;
			} else {
				b++;
			}
		}
		if ((s[i][1]=='A')&&(s[i][0]!='B')) a++;
	}

	if (DEBUG) printf("a b ba : %d %d %d\n",a,b,ba);
	if (ba==0) ans += min(a,b);
	if (ba!=0) {
		ans += ba-1;
		if (a>0) { ans++; a--; }
		if (b>0) { ans++; b--; }
		ans += min(a,b);
	}

	printf("%d\n",ans);

	return 0;
}

