#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
/********************************************************************************************************************************/
/* main *************************************************************************************************************************/
/********************************************************************************************************************************/
int DEBUG = 1;										/* デバッグプリント 提出時は0 */

int main()
{

	int		N,Q,i,p,u,l,j,q = 0;
	char	c;
	char	b[27] = { 'A', 0 };

	scanf("%d %d", &N, &Q);

	for(i=1; i<N; i++) {
		p = i / 2;
		u = i;
		l = 0;
		do {
			printf("? %c %c\n",b[p], 'A'+i);
			fflush(stdout);
			scanf(" %c", &c);
			q++;
			if (q>Q) printf("ERROR! %d > %d\n",q,Q);
			if (c == '>') {
				u = p;
			} else {
				l = p+1;
			}
			p = (u - l) / 2 + l;
		} while (u!=l);
		for(j=i-1; j>=u; j--) {
			b[j+1] = b[j];
		}
		b[u] = 'A'+i;
		if (DEBUG) printf("DBG:%s\n",b);
	}

	printf("! %s\n",b);
	fflush(stdout);

	return 0;
}

